Tekla.Structures.Drawing.NormalLineType
The NormalLineType class defines the non-custom line types that can be used by the drawing objects.

Tekla.Structures.Drawing.NormalLineType.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.NormalLineType.Equals(System.Object)
Returns true if the current object and the given object are equal.
obj: The object we wish to check the equality with.
Returns: True if the given object equals the current object.

Tekla.Structures.Drawing.NormalLineType.GetHashCode
Returns a hash code for the object.
Returns: The hash code for the object.

Tekla.Structures.Drawing.NormalLineType.op_Equality(Tekla.Structures.Drawing.NormalLineType,Tekla.Structures.Drawing.NormalLineType)
Returns true if the current object and the given object are equal.
a: The first object we wish to check the equality with.
b: The second object we wish to check the equality with.
Returns: True if both objects equals each other.

Tekla.Structures.Drawing.NormalLineType.op_Inequality(Tekla.Structures.Drawing.NormalLineType,Tekla.Structures.Drawing.NormalLineType)
Returns true if the current object and the given object are not equal.
a: The first object we wish to check the inequality with.
b: The second object we wish to check the inequality with.
Returns: True if the objects are not equal.

Tekla.Structures.Drawing.NormalLineType.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2